# Parameters
nc: 1 # number of classes
depth_multiple: 0.33 # model depth multiple
width_multiple: 0.50 # layer channel multiple
anchors:
  - [5, 6, 8, 14, 15, 11]  # P2/4
  - [10, 13, 16, 30, 33, 23] # P3/8
  - [30, 61, 62, 45, 59, 119] # P4/16
  - [116, 90, 156, 198, 373, 326] # P5/32

backbone:
  # [from, number, module, args]
  [
    [-1, 1, Conv, [64, 6, 2, 2]], # 0-P1/2
    [-1, 1, Conv, [128, 3, 2]], # 1-P2/4
    [-1, 3, C3, [128]],  # 2 160 * 160
    [-1, 1, CBAM, [128]],  # 3
    [-1, 1, Conv, [256, 3, 2]], # 4-P3/8
    [-1, 6, C3, [256]], # 5
    [-1, 1, CBAM, [256]], #6
    [-1, 1, Conv, [512, 3, 2]], # 7-P4/16
    [-1, 9, C3, [512]],  # 8
    [-1, 1, CBAM, [512]], #9
    [-1, 1, Conv, [1024, 3, 2]], # 10-P5/32
    [-1, 3, C3, [1024]],  # 11
    [-1, 1, SPPF, [1024, 5]], # 12
  ]
head: [
    [-1, 1, Conv, [512, 1, 1]], # 13
    [-1, 1, nn.Upsample, [None, 2, "nearest"]], # 14
    [[-1, 9], 1, BiFPN_Add2, [256, 256]], # cat backbone P4  # 15
    [-1, 3, C3, [512, False]], # 16

    [-1, 1, Conv, [256, 1, 1]], # 17
    [-1, 1, nn.Upsample, [None, 2, "nearest"]], # 18
    [[-1, 6], 1, BiFPN_Add2, [128, 128]], # cat backbone P3 # 19
    [-1, 3, C3, [256, False]],  # 20

    [-1, 1, Conv, [128, 1, 1]], # 21
    [-1, 1, nn.Upsample, [None, 2, "nearest"]], #22
    [[-1, 3], 1, BiFPN_Add2, [64, 64]],  # 23  p2
    [-1, 3, C3, [128, False]],  # 24  tiny

    [-1, 1, Conv, [256, 3, 2]],  # 25
    [[-1, 20, 5], 1, BiFPN_Add3, [128, 128]], # 26 p3
    [-1, 3, C3, [256, False]], # 27 p3  small

    [-1, 1, Conv, [512, 3, 2]], # 28
    [[-1, 16, 7], 1, BiFPN_Add3, [256, 256]], # 29 cat head P4
    [-1, 3, C3, [512, False]], # 30 medium

    [-1, 1, Conv, [512, 3, 2]],  # 31
    [[-1, 13], 1, BiFPN_Add2, [256, 256]], # 32 cat head P5
    [-1, 3, C3, [1024, False]], # 33 large

    [[24, 27, 30, 33], 1, Detect, [nc, anchors]], # Detect(P2, P3, P4, P5)
  ]